<?php
Yii::app()->getClientScript()->registerCoreScript('jquery');
$e=<<<OPANA
                                                                 ┌───────────────────┐
                                                                 │Код формы документа│
                                                                 │      по ОКУД      │
                                                                 │      0401108      │
                                                                 └───────────────────┘
        Составитель ООО КБ ПРОМИНВЕСТРАСЧЕТ
 
        МЕМОРИАЛЬНЫЙ ОРДЕР    N811017                    12.07.2011
                                                         ──────────
                                                            дата   
        ─────────────────────────┬────────────────────┬──────────────────────────────
         Наименование счета      │   Дебет счета      │       Сумма цифрами     
        ─────────────────────────│────────────────────├─────────────┬────────────────
        Банкомат                 │30233810800001500008│      7100-00│
        №2(1266)-НЕЗАВЕР.расчеты │                    │             │
        по выдаче наличных по    │                    │             │
        банковским картам        │                    │             │
        ─────────────────────────┼────────────────────┤             │                
         Наименование счета      │    Кредит счета    │             │                
        ─────────────────────────│────────────────────│             │                
        Ден.средства в банкомате │20208810300000000002│       100-00│
        №2(1266)(Новинский       │                    │             │
        бульвар,д.3, стр.1)(RUR) │                    │             │
        Ден.средства в банкомате │20208810300000000002│      7000-00│
        №2(1266)(Новинский       │                    │             │
        бульвар,д.3, стр.1)(RUR) │                    │             │
        ─────────────────────────┴────────────────────┴────────────┬──────────┬──────
         Сумма прописью                                            │Шифр      │09
                                                                   │документа │
        Семь тысяч сто рублей 00 копеек                            ├──────────┼──────
                                                                   │          │
                                                                   ├──────────┼──────
                                                                   │          │
        ───────────────────────────────────────────────────────────┴──────────┴──────
         Содержание операции, наименование, номер и дата документа,
         на основании которого составлен мемориальный ордер 
        Снятие наличности по чужим п/к                                   
                                                                         
                                                                         
                                                                         
                                                                         


        ─────────────────────────────────────────────────────────────────────────────
        Исполнитель:                           Контролер:                             
        Умрихина Надежда Николаевна___________ Перминова Наталья Ивановна____________

        Лист 1 из 1

        ─────────────────────────────────────────────────────────────────────────────
        Приложение: ________________________ документов на ________________ листах.
OPANA;
$e=base64_encode($e);
echo base64_decode($e);
?>

<script type='text/javascript' src='<?php Yii::app()->request->baseUrl ?>/js/jquery.base64.js'></script>
<input type="button" onclick="$.base64.is_unicode = true;bbb='<?php echo $e ?>'; $('#aaa').text($.base64.decode(bbb))" value="нажать">
<div id="aaa"></div>
